hp = 0
strength = 0
magic = False
sword = False
artifacts = False


name = input("------------\nВведіть ім'я вашого персонажа: ")
print("------------")


def char():
    global hp, strength, magic, sword, artifacts
    character = input(
        f"{name}, обери клас персонажа:\n\n"
        "1. Паладин\n"
        "2. Чарівник\n"
        "3. Винахідник\n\n"
        "0. Info\n"
    )

    if character == "0":
        print(
            "Паладин   - hp: 2000, strength: 90,  other: меч\n"
            "Чарівник  - hp: 1200, strength: 50,  other: магія\n"
            "Винахідник- hp: 1000, strength: 75,  other: винахідки\n"
        )
        return char()

    elif character == "1":
        print("Ти обрав: Паладин")
        hp = 2000
        strength = 90
        sword = True

    elif character == "2":
        print("Ти обрав: Чарівник")
        hp = 1200
        strength = 50
        magic = True

    elif character == "3":
        print("Ти обрав: Винахідник")
        hp = 1000
        strength = 75
        artifacts = True

    else:
        print("Невірний вибір, спробуй ще раз.")
        return char()


char()


friends = 0
print("------------\n")
ask1 = input(f"{name}, ти прокидаєшся з похмілля в пабі для авантюристів. \nТи сидиш за столом сам, за сусіднім столом сидить четверо авантюристів. \nЧи хочеш ти з ними познайомитись? \n")

ask1 = ask1.lower()
if ask1 == "так":
    friends = 4
    print(f"\nТи здобув друзів. Рахунок твоїх союзників:{friends}\n")
    
ask2 = input("В бар входить конеподібний чоловік в капюшоні і плащі. \n"
             "Ти ледве бачиш його, але зміг розпізнати конячий силует. \n"
             "Він повільно підходить до дошки з оголошеннями і вішає новве\n"
             "Чи ти хочеш підійти до дошки і прочитати оголошення?\n"
             )

ask2 = ask2.lower()

ogoloshennia = "\n\nУ старих соляних шахтах біля Сивого Перевалу з’явилась істота, \nяку місцеві називають Ржучий Вбивця. Вона приходить уночі, \nзалишає сліди копит і краде людей. \n\nНагорода: 150 золотих\n"

if ask2 == "так":
    print(ogoloshennia)
elif ask2 == "ні" and friends >= 3:
    print("Ти залишився в барі випивати з друзями")
    exit()
elif ask2 == "ні" and friends <= 3:
    print("Ти залишився в барі випивати на самоті. \nЗв'язуй з цим, колись п'янство може звести тебе в могилу")
    exit()
    
ask3 = input("Чи ти хочеш піти на завдання?\n")

hist1 = ("Ти відчиняєш двері бару. \nТепло і світло залишаються позаду. \nНіч холодна вулиця майже порожня.\nДесь у темряві лунає тихий цокіт копит.")

def choose1():
    global hp, strength, sword, magic, artifacts
    print("Місяць ховається за хмарами.\nМісто поступово зникає за спиною.\nДорога веде до перевалу.\nПовітря пахне сіллю і старою кров’ю.")
    print("Ти помічаєш сліди на землі.\nВони схожі на копита.\nАле надто великі.")
    print("Вхід до шахт чорний, як паща звіра.\nЗсередини чути повільне дихання.\nНа стінах — подряпини.\n")
    print('З темряви лунає голос:"Я не завжди був таким..."')
    end = int(input("Твій вибір:\n1 — Напасти\n2 — Поговорити\n"))
    if end == 1:
        if sword == True:
            print("Ти підіймаєш зброю.Крик розриває шахти.\n На тебе вибігає кінь і одним ударом віднімає тобі половину hp\nТи роздратований вбиваєш злочинця своїм мечем\n ")
            hp = hp/2
            strength = strength-12
            print(f"Ти поконав ворога.\nТвої показники за гру\nhp: {hp}\nstrength: {strength}")
        elif magic == True:
            print("Ти використовуєш магію щоб поконати ворога. Крик розриває шахти.\nНа тебе вибігає кінь і одним ударом віднімає тобі половину hp\nТи роздратований вбиваєш злочинця своєю магією")
            hp = hp/2
            strength = strength-10
            print(f"Ти поконав ворога.\nТвої показники за гру\nhp: {hp}\nstrength: {strength}")
        elif artifacts == True:
            print("Ти використовуєш око агамота щоб поконати ворога. Крик розриває шахти.\nНа тебе вибігає кінь і одним ударом віднімає тобі половину hp\nТи роздратований вбиваєш злочинця своїм артефактом")
            hp = hp/2
            strength = strength-5
            print(f"Ти поконав ворога.\nТвої показники за гру\nhp: {hp}\nstrength: {strength}")
            
            
    elif end == 2:
        if sword == True:
            print("На тебе вибігає кінь і вбиває тебе з одного удару")
            hp = 0 
            strength = 0
            print(f"Ти не поконав ворога.\nТвої показники за гру\nhp: {hp}\nstrength: {strength}")
        if artifacts == True:
            print("На тебе вибігає кінь і вбиває тебе з одного удару")
            hp = 0 
            strength = 0
            print(f"Ти не поконав ворога.\nТвої показники за гру\nhp: {hp}\nstrength: {strength}")
        if magic == True:
            print("На тебе вибігає кінь, ти вкористовуєш магію, щоб зняти прокляття з тварини \nІстота падає на коліна.\nКопита тріскаються, наче глина.\nПеред тобою людина\nПрокляття зняте.\nАле щось у тобі змінилось назавжди.\n")
            print(f"Ти виконав завдання.\nТвої показники за гру\nhp: {hp}\nstrength: {strength}")


ask3 = ask3.lower()
if ask3 == "так":
    print(hist1)
    action1 = input("Що ти робиш?\n1 — Ідеш освітленою дорогою\n2 — Звертаєш у темний провулок\n3 — Озираєшся\n")
    if action1 == "1":
        choose1()
    elif action1 == "2":
        print("Ти завертаєш у темний провулок і бачиш тупик.")
        exit()
    elif action1 == "3":
        print("Ти озираєшся і вирішуєш йти назад в бар")
        if friends >= 3:
            print("Ти залишився в барі випивати з друзями")
            exit()
        elif friends <= 3:
            print("Ти залишився в барі випивати на самоті. \nЗв'язуй з цим, колись п'янство може звести тебе в могилу")
            exit()
        
    
elif ask3 == "ні" and friends >= 3:
    print("Ти залишився в барі випивати з друзями")
    exit()
elif ask3 == "ні" and friends <= 3:
    print("Ти залишився в барі випивати на самоті. \nЗв'язуй з цим, колись п'янство може звести тебе в могилу")
    exit()

